In [303]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.cross_validation import train_test_split
pd.options.mode.chained_assignment = None
from sklearn.externals import joblib
import time

from datetime import datetime

In [304]:
data = pd.read_csv('input.csv')
data.head()

          time_started           time_ended type  from_place_id  to_place_id
0  2016-04-20 06:32:56  2016-04-20 07:12:23  car              1            2
1  2016-04-19 15:27:30  2016-04-19 16:12:53  car              2            1
2  2016-04-19 09:52:46  2016-04-19 10:26:07  car              3            2
3  2016-04-19 07:41:08  2016-04-19 07:56:39  car              1            3
4  2016-04-18 11:26:08  2016-04-18 11:43:31  car              3            1

In [305]:
data = data[['time_started', 'time_ended', 'type', 'from_place_id', 'to_place_id']]
data.head()

          time_started           time_ended type  from_place_id  to_place_id
0  2016-04-20 06:32:56  2016-04-20 07:12:23  car              1            2
1  2016-04-19 15:27:30  2016-04-19 16:12:53  car              2            1
2  2016-04-19 09:52:46  2016-04-19 10:26:07  car              3            2
3  2016-04-19 07:41:08  2016-04-19 07:56:39  car              1            3
4  2016-04-18 11:26:08  2016-04-18 11:43:31  car              3            1

In [306]:
# replace times with epoch
data['time_started'] = data['time_started'].apply(lambda x: int(time.mktime(time.strptime(x, '%Y-%m-%d %H:%M:%S'))))
data['time_ended'] = data['time_ended'].apply(lambda x: int(time.mktime(time.strptime(x, '%Y-%m-%d %H:%M:%S'))))
data.head()

   time_started  time_ended type  from_place_id  to_place_id
0    1461126776  1461129143  car              1            2
1    1461072450  1461075173  car              2            1
2    1461052366  1461054367  car              3            2
3    1461044468  1461045399  car              1            3
4    1460971568  1460972611  car              3            1

In [307]:
data['type'] = data['type'].map({'car': 1, 'mpk': 2, 'bike': 3})
data['to_place_id'] = data['to_place_id'].apply(lambda x: x if x != 4 else 2)
data['from_place_id'] = data['from_place_id'].apply(lambda x: x if x != 4 else 2)
data['day_of_week'] = data['time_started'].apply(lambda timestamp: datetime.fromtimestamp(timestamp).weekday())

def military_time(timestamp):
    stamp = datetime.fromtimestamp(timestamp)
    return stamp.hour * 60 + stamp.minute

#data['time_started'] = data['time_started'].apply(military_time)

data.head(20)

    time_started  time_ended  type  from_place_id  to_place_id  day_of_week
0     1461126776  1461129143     1              1            2            2
1     1461072450  1461075173     1              2            1            1
2     1461052366  1461054367     1              3            2            1
3     1461044468  1461045399     1              1            3            1
4     1460971568  1460972611     1              3            1            0
5     1460965239  1460966986     1              2            3            0
6     1460950237  1460952780     1              1            2            0
7     1460725287  1460726723     1              2            1            4
8     1460696189  1460698391     1              1            2            4
9     1460640412  1460642282     1              2            1            3
10    1460609446  1460611610     1              1            2            3
11    1460551795  1460553469     1              2            1            2
12    1460522806  1460525093     1              1            2            2
13    1460469306  1460470388     1              3            1            1
14    1460460415  1460463522     1              2            3            1
15    1460436510  1460438994     1              1            2            1
16    1460366647  1460368671     2              3            1            0
17    1460360402  1460362434     2              1            3            0
18    1460112593  1460114569     1              2            1            4
19    1460092623  1460094579     1              1            2            4

In [308]:
data_inputs = data[['day_of_week', 'from_place_id']]
data_inputs.head(10)

   day_of_week  from_place_id
0            2              1
1            1              2
2            1              3
3            1              1
4            0              3
5            0              2
6            0              1
7            4              2
8            4              1
9            3              2

In [309]:
expected_output = data[['to_place_id']]
expected_output.head(10)

   to_place_id
0            2
1            1
2            2
3            3
4            1
5            3
6            2
7            1
8            2
9            1

In [310]:
inputs_train, inputs_test, expected_output_train, expected_output_test   = train_test_split (data_inputs, expected_output, test_size = 0.33, random_state = 42)
print(inputs_train.head())
print(expected_output_train.head())

    day_of_week  from_place_id
46            1              2
47            1              1
15            1              1
9             3              2
16            0              3
    to_place_id
46            1
47            2
15            2
9             1
16            1

In [311]:
# Create the random forest instance, and train it with training data
rf = RandomForestClassifier(n_estimators=100)
rf.fit(inputs_train, expected_output_train)

C:\Users\mpomaran\Anaconda3\lib\site-packages\ipykernel\__main__.py:3: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  app.launch_new_instance()

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=100, n_jobs=1,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [312]:
# Get the accuracy of your model
accuracy = rf.score(inputs_test, expected_output_test)
print("Accuracy = {}%".format(accuracy * 100))

Accuracy = 82.35294117647058%

In [313]:
# Write the model to a file called "titanic_model2"
joblib.dump(rf, "voyages_model1", compress=9)

['voyages_model1']